app/controllers/clips_controller.rb

SELECT "clips".* FROM "clips"
---
  def index
    @clips = Clip.all

SELECT "clips".* FROM "clips" WHERE "clips"."shortlink" = '7e9681' LIMIT 1
---
  def show
    @clip = Clip.where(shortlink: params[:shortlink]).first

INSERT INTO "clips" ("created_at", "file", "length", "name", "screenshot", "shortlink", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    user = User.where(token: params[:token]).first
    if user.present?
      @clip = Clip.new(params[:clip]) #params[:token]
    else
      false
    end

    respond_to do |format|
      if @clip.save!