app/controllers/home_controller.rb

SELECT COUNT(*) FROM "clips"
---
  def index
    @clips_count = Rails.cache.fetch('home-clip-count', expires_in: 12.hours) {Clip.count}